In [1]:
import numpy as np
import pandas as pd
from

In [5]:
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [11]:
df.W

A   -0.555905
B   -0.404354
C   -0.961280
D    0.482456
E   -0.083995
Name: W, dtype: float64

In [12]:
type(df)

pandas.core.frame.DataFrame

In [14]:
type(df['W'])

pandas.core.series.Series

In [15]:
df[['W','X']]

          W         X
A -0.555905 -0.170472
B -0.404354 -0.548104
C -0.961280 -0.259033
D  0.482456 -1.186845
E -0.083995  1.469940

In [16]:
df['new']=df['X']+df['W']

In [18]:
df

          W         X         Y         Z       new
A -0.555905 -0.170472 -1.081171 -2.092448 -0.726377
B -0.404354 -0.548104 -0.808076 -1.415687 -0.952457
C -0.961280 -0.259033  0.378301  0.791257 -1.220313
D  0.482456 -1.186845 -0.771572 -0.553616 -0.704389
E -0.083995  1.469940  0.382827 -0.336997  1.385944

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [20]:
df

          W         X         Y         Z       new
A -0.555905 -0.170472 -1.081171 -2.092448 -0.726377
B -0.404354 -0.548104 -0.808076 -1.415687 -0.952457
C -0.961280 -0.259033  0.378301  0.791257 -1.220313
D  0.482456 -1.186845 -0.771572 -0.553616 -0.704389
E -0.083995  1.469940  0.382827 -0.336997  1.385944

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [24]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616

In [25]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [26]:
df.drop('E',axis=0,inplace=False)

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616

In [28]:
df.loc['C']

W   -0.961280
X   -0.259033
Y    0.378301
Z    0.791257
Name: C, dtype: float64

In [29]:
df.iloc[2]

W   -0.961280
X   -0.259033
Y    0.378301
Z    0.791257
Name: C, dtype: float64

In [30]:
df.iloc[0]

W   -0.555905
X   -0.170472
Y   -1.081171
Z   -2.092448
Name: A, dtype: float64

In [31]:
df.loc['A','Z']

-2.0924475340130235

In [32]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [34]:
df.loc[['A','B'] ,['Y','Z']]

          Y         Z
A -1.081171 -2.092448
B -0.808076 -1.415687

In [35]:
df>0

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False   True   True
D   True  False  False  False
E  False   True   True  False

In [36]:
bool=df>0

In [37]:
bool

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False   True   True
D   True  False  False  False
E  False   True   True  False

In [38]:
df[bool]

          W        X         Y         Z
A       NaN      NaN       NaN       NaN
B       NaN      NaN       NaN       NaN
C       NaN      NaN  0.378301  0.791257
D  0.482456      NaN       NaN       NaN
E       NaN  1.46994  0.382827       NaN

In [39]:
df[df<0]

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033       NaN       NaN
D       NaN -1.186845 -0.771572 -0.553616
E -0.083995       NaN       NaN -0.336997

In [40]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [41]:
df['Y']

A   -1.081171
B   -0.808076
C    0.378301
D   -0.771572
E    0.382827
Name: Y, dtype: float64

In [44]:
df[df['Y']<0]

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
D  0.482456 -1.186845 -0.771572 -0.553616

In [45]:
df[df['W']<0]

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
E -0.083995  1.469940  0.382827 -0.336997

In [46]:
salb=df[df['W']<0]

In [47]:
salb

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
E -0.083995  1.469940  0.382827 -0.336997

In [49]:
salb['X']

A   -0.170472
B   -0.548104
C   -0.259033
E    1.469940
Name: X, dtype: float64

In [50]:
df[df['W']<0]['X']

A   -0.170472
B   -0.548104
C   -0.259033
E    1.469940
Name: X, dtype: float64

In [60]:
df[df['W']<0][['X','Y']]

          X         Y
A -0.170472 -1.081171
B -0.548104 -0.808076
C -0.259033  0.378301
E  1.469940  0.382827

In [61]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [65]:
df[(df['W']<0) &  (df['X']<0)]

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257

In [71]:
df[(df['W']<0) | (df['X']<0)]

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [70]:
df[df['X']<0]

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616

In [72]:
df

          W         X         Y         Z
A -0.555905 -0.170472 -1.081171 -2.092448
B -0.404354 -0.548104 -0.808076 -1.415687
C -0.961280 -0.259033  0.378301  0.791257
D  0.482456 -1.186845 -0.771572 -0.553616
E -0.083995  1.469940  0.382827 -0.336997

In [73]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.555905 -0.170472 -1.081171 -2.092448
1     B -0.404354 -0.548104 -0.808076 -1.415687
2     C -0.961280 -0.259033  0.378301  0.791257
3     D  0.482456 -1.186845 -0.771572 -0.553616
4     E -0.083995  1.469940  0.382827 -0.336997

In [74]:
newind ='ab cd ef gh kl'.split()

In [75]:
newind

['ab', 'cd', 'ef', 'gh', 'kl']

In [76]:
df['new']=newind

In [77]:
df

          W         X         Y         Z new
A -0.555905 -0.170472 -1.081171 -2.092448  ab
B -0.404354 -0.548104 -0.808076 -1.415687  cd
C -0.961280 -0.259033  0.378301  0.791257  ef
D  0.482456 -1.186845 -0.771572 -0.553616  gh
E -0.083995  1.469940  0.382827 -0.336997  kl

In [79]:
df.set_index('new')

            W         X         Y         Z
new
ab  -0.555905 -0.170472 -1.081171 -2.092448
cd  -0.404354 -0.548104 -0.808076 -1.415687
ef  -0.961280 -0.259033  0.378301  0.791257
gh   0.482456 -1.186845 -0.771572 -0.553616
kl  -0.083995  1.469940  0.382827 -0.336997

In [80]:
outside =['G1','G1','G1','G2','G2','G2']

In [81]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [82]:
inside=[1,2,3,1,2,3]

In [83]:
hire_index=list(zip(outside,inside))

In [84]:
hire_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [85]:
hire_index=pd.MultiIndex.from_tuples(hire_index)

In [86]:
hire_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
df2=pd.DataFrame(np.random.randn(6,2),hire_index,['A','B'])

In [90]:
df2

             A         B
G1 1  0.163546 -2.182672
   2  0.467764 -0.155798
   3  0.646477 -0.628320
G2 1 -0.839896  0.189434
   2  1.219225 -0.125568
   3  0.507766 -1.377363

In [91]:
df2.loc['G1']

          A         B
1  0.163546 -2.182672
2  0.467764 -0.155798
3  0.646477 -0.628320

In [92]:
df2.loc['G1'].loc[2]

A    0.467764
B   -0.155798
Name: 2, dtype: float64

In [93]:
df2.index.names=['groups','num']

In [94]:
df2

                   A         B
groups num
G1     1    0.163546 -2.182672
       2    0.467764 -0.155798
       3    0.646477 -0.628320
G2     1   -0.839896  0.189434
       2    1.219225 -0.125568
       3    0.507766 -1.377363

In [97]:
df2.xs('G1')

            A         B
num
1    0.163546 -2.182672
2    0.467764 -0.155798
3    0.646477 -0.628320

In [106]:
df2.xs(1,level='num')

               A         B
groups
G1      0.163546 -2.182672
G2     -0.839896  0.189434